Allowlist
allowlist
Artifactory
Artifactory's
Atlassian
Authy
Autoscaling
Basecamp
Basscss
Bazel
Bitium
Boomper
Buildbox
Buildkite
Buildkite's
CI
CloudWatch
Crontab
Datadog
Deprovisioning
Distro
Docker's
Dockerfile
Enum
Eventbridge
Explainshell
fastlane
Firewalled
Flexbox
Fugit
GitLab
Gradle
Hashicorp
Inlining
Jenkins
JWT
JWTs
Kuzco
Memcache
macOS
minitest
misconfiguration
Namespace
Namespaced
Namespaces
Noreply
Okta
Pagerduty
Phabricator
Phabricator's
Pipenv
Postgres
Powershell
Readme
RSpec
Shardy
Shellcheck
Shipit
Unencrypted
Unset
Unsets
Unsetting
Webtask
Xcode
Zapier
addr
api
apis
architecting
argumentless
artifactory
auditable
autogenerate
autogenerated
autogenerates
autoscale
autoscaler
autoscaling
aws
azcopy
boolean
boomper
buildscript
cancelation
ccnet
chatbot
chroot
chroots
ci
classpath
cli
composable
config
cpu
cron
crontab
Datadog
deprioritize
deprovisioning
deregistration
deprovision
distro
Dockerfile
dogstatsd
enum
env
eval
eventbridge
favorited
fff
ffxdq
gcloud
gif
githooks
globbing
gotestsum
Graviton
gz
gzipped
heroku
hostname
http
httplog
https
inlining
IPs
jpegs
jq
json
junit
kubectl
kustomize
launchd
LFS
libpq
linux
Memcache
Minitest
mitigation
mitigations
monorepo
mutex
namespace
namespaced
namespaces
negator
npm
ns
nsc
nssm
onboarding
parsable
phabricator
php
plaintext
plist
png
pngs
powershell
preemptible
prefill
pty
pullrequest
pybuildkite
pytest
rbenv
readme
readmes
refetch
refspec
repo
routable
ruleset
runtimes
rvm
sandboxed
sed
scriptwrapper
sha
sharding
shasum
Shellcheck
shellscripting
Shipit
sre
sso
statefully
stdout
subcommand
subcommands
subfolders
submenu
subnet
subnets
subnet's
substrings
sudo
svg
swiftformat
systemd
templated
timeframe
tmp
tmux
toolmantim
tooltip
udp
unarchive
unarchived
unarchiving
unblocker
unbuildable
unclustered
unencrypted
unmanaged
untrusted
unset
unsets
unsetting
unxip
uploaders
url
urls
util
uuid
vendored
waitlist
walkthrough
webhook's
webtask
wget
worktree
workspace's
xcbeautify
xcode
xcodebuild
xcpretty
yaml
yml
yq
yyy
zstd
zzz
ACLs
AMI's
AMIs
API's
CCMenu
CCTray
CMake
IdP's
iTerm
iTerm's
NGINX
NVMe
OAuth
TOTP's
UUIDs
VMs
VPC's
VPCs
XCTest
xUnit
dotenv
keyserver
keyservers

# GraphQL code words
# TODO: format these as code instead of making exceptions
heartbeatAt
TOTPActivate
TOTPActivate
TOTPCreate
TOTPCreate
TOTPDelete
