ACLs
addr
agentic
allow_any_instance_of
allowlist
allowlisted
allowlists
Amazon ECR
Amazon Elastic Container Registry
AMI's
AMIs
Ansible
Anthropic's
anti-pattern
Anyfile
API
api
API's
APIs
apk
APM
applesimutils
Aqua
architecting
Argo CD
ARNs
argumentless
Artifactory
Artifactory's
Athena
Atlassian
auditability
Authy
auditable
autogenerate
autogenerated
autogenerates
automations
autoscale
autoscaler
autoscalers
Autoscaling
autoscaling
aws
awscli
azcopy
Backstage
Backstage Software Catalog
Basecamp
Basscss
Bottlerocket
Bayesian
Bazel
Bazel's
bazelisk
Bitium
Bitbucket
Bitrise
bktec
bktec's
boolean
Boomper
bottlenecked
Brewfile
Buildbox
buildevents
Buildah
BuildKit
Buildkite
Buildkite's
buildscript
Buildx
buildx
Bundler
bursty
cancelation
carthage
Cachew
CCMenu
ccnet
CCTray
Chainguard
Chainguard's
chatbot
chroot
chroots
CI
ClamAV
classpath
claude
cli
CLI
CLIs
Cloudsmith
Cognito
Cooldown
Cloudsmith's
CloudTrail
CloudWatch
CMake
cmake
cocoapods
codeql
codesign
codesigning
Cognito
commit_sha
completion_watcher
composable
config
configs
configmap
Containerfile
Containerfiles
corepack
cpu
cron
crontab
Crontab
CVE
CVEs
cutover
daemonless
Datadog
Datadog's
daemonless
datasource
debuild
declaratively
deduper
deno
deprioritize
deprovisioning
deregistration
deprovision
dialog's
dialogs
discoverability
distro
distutils
Dockerfile
Dockerfile's
Dockerfiles
Docker's
Dockerfile
Docker-in-Docker
dogstatsd
dotenv
DSCs
ecr
emptyDir
dequeued
enqueued
Entra
enum
env
errored
eval
Eventbridge
EventBridge
exfiltrate
exfiltrated
exfiltration
explainshell
fastfile
fastlane
fastlane's
favorited
fff
ffxdq
Firehose
Firewalled
firewalled
Flexbox
fpm
Fugit
gcloud
gh
gif
githooks
GitLab
globbing
gmp
gnupg
goroutines
gotestsum
gpg
GPU
GPUs
Grafana
Gradle
gradle
Gradle's
graphql_id
Graviton
GRC
GuardDog
gz
gzipped
hard-code
hard-coded
hard-coding
Hashicorp
Homebrew
heroku
Honeycomb
hostname
hostPath
hotfixes
http
httpd
httplog
https
IdP's
if_changed
initContainer
inlining
IPs
iTerm
iTerm's
Jenkins
Jenkinsfile
Jenkinsfiles
JFrog
JFrog's
job_watcher
jobWatcher
jpegs
jq
json
junit
JWT
JWTs
Kaniko
keyserver
keyservers
keyless
kotlin
kubeconfig
kubectl
kubelet
kustomize
Kinesis
Kuzco
launchd
LFS
libpq
Lifecycled
lifecycled
Lightstep
linux
llamasecret
LLMs
llvm
lockfile
lockfiles
lockfile‑keyed
lookback
macOS
macos
manylinux
matchfile
matchers
Memcache
minitest
misconfiguration
misconfigurations
misconfigured
mitigation
mitigations
monorepo
monorepos
mrkdwn
multi-file
mutex
namespace
Namespace's
namespaced
namespaces
namespacing
Namespacing
navatar
negator
NGINX
nginx
Nodejs
nodeName
nodeSelector
Noreply
not_run
npm
ns
nsc
nssm
nullable
NVMe
OAuth
offboarding
oidc
onboarding
Okta
OpenTelemetry
OTel
opentelemetry
onboarding
OTLP
otlp
overprivileged
Pagerduty
Packagecloud
Packagecloud's
Palo
parsable
parallelization
parameterization
pbuilder
pbuilder's
perl
Phabricator
Phabricator's
php
Pipenv
pkgconf
plaintext
plist
png
pngs
pnpm
pod_watcher
podWatcher
polyrepo
polyrepos
Postgres
PowerShell
PR's
predeclare
predeclared
Prepends
Prometheus
protobuf
preemptible
prefill
prefetch
preinstall
prepends
preprovisioned
proxied
ptrace
pty
pullrequest
pybuildkite
pytest
queryable
rbenv
readme
readmes
rearchitect
rebalancing
refetch
refspec
rehydrate
rehydrated
reimagined
remediation
remediations
repo
reprioritize
reprioritizes
resizable
retryable
rollout
rollouts
retag
retrigger
routable
rpmbuild
RSpec
ruleset
runbook
runbooks
runtimes
rustup
rvm
sandboxed
SBOM
SBOMs
seccomp
sed
serverless
scriptwrapper
SDK
SDK's
SDKs
semver
sha
SHAs
sharding
Shardy
shasum
shellcheck
shellscripting
Shipit
sigstore
sigstore's
signaltometrics
skopeo
SLA
SLAs
SLO
SLOs
snake_case
Sonar
SonarCloud
SonarQube
SonarScanner
Snyk
Sonatype
Sonoma
Splitter's
sre
sso
stack_error
start_time
statefully
stdin
stdout
streamable
stringified
subcommand
subcommands
subfolders
submenu
subnet
subnets
subnet's
subpatterns
substrings
sudo
svg
swiftformat
swiftlint
syntaxes
systemd
Tailscale
teardown
templated
tgz
timeframe
tmp
tmux
tokenization
toolchain
toolchains
toolmantim
toolset
toolsets
tooltip
TOTP's
TPUs
traceparent
Trivy
trixie
typosquatted
udp
unmanaged
untracked
UserData
unarchive
unarchived
unarchiving
Uncomment
unblocker
unbuildable
unclustered
unencrypted
unpatched
unpermitted
unreviewed
unscoped
unset
unsets
unsetting
unstaged
untrusted
unxip
uploaders
upstreams
url
urls
userdata
util
uuid
UUIDs
uv
vendored
vfs
virtualenv
virtualized
Vitest
VMs
VPC's
VPCs
VPNs
waitlist
walkthrough
webhook's
webtask
wget
whoami
Windsurf's
workgroup
worktree
worktrees
workspace's
xcbeautify
Xcode
xcode
xcodebuild
xcodes
xcpretty
XCTest
xUnit
yaml
yml
yq
yyy
Zapier
Zipkin
zstd
zzglob
zzz

# Other BK CLI words/terms
# These exceptions cannot easily be added by escaping vale linting
# within their Markdown files, as these files are autogenerated from
# a different source (i.e. the BK CLI repo itself)
alice
greg

# GraphQL code words
# TODO: format these as code instead of making exceptions
heartbeatAt
TOTPActivate
TOTPActivate
TOTPCreate
TOTPCreate
TOTPDelete

Queries

agentToken

auditEvent

graphQLSnippet

notificationService

organizationInvitation
organizationMember

pipelineSchedule
pipelineTemplate

Mutations

agentPause
agentResume
agentStop

annotationDelete

buildAnnotate
buildCancel
buildCreate
buildRebuild

clusterCreate
clusterDelete
clusterUpdate

emailCreate

jobAnnotate

noticeDismiss

pipelineArchive
pipelineCreate
pipelineDelete
pipelineFavorite
pipelineUnarchive
pipelineUpdate

ruleCreate
ruleDelete
ruleUpdate

teamCreate
teamDelete
teamUpdate

totpActivate
totpCreate
totpDelete

Objects

APIApplication

SCMService

SSOAuthorization

Enums

Input_objects

__Directive
__Field
__Schema
__Type

SSOProvider

ssoProvider

JSInt

landing_page

bazel

github

landing_page_pipelines

eg

base_sha
base_ref
head_sha
head_ref
if_changed
