ACLs
addr
allow_any_instance_of
Allowlist
allowlist
AMI's
AMIs
API
API's
APIs
apk
architecting
argumentless
Artifactory
Artifactory's
Atlassian
Authy
auditable
autogenerate
autogenerated
autogenerates
autoscale
autoscaler
Autoscaling
autoscaling
aws
azcopy
Basecamp
Basscss
Bazel
Bitium
bktec
boolean
Boomper
Buildbox
Buildkite
Buildkite's
buildscript
Bundler
cancelation
CCMenu
ccnet
CCTray
chatbot
chroot
chroots
CI
classpath
cli
CloudWatch
CMake
composable
config
cpu
cron
crontab
Crontab
Datadog
debuild
deprioritize
deprovisioning
deregistration
deprovision
dialog's
distro
distutils
Dockerfile
Docker's
Dockerfile
dogstatsd
dotenv
DSCs
enum
env
eval
Eventbridge
EventBridge
Explainshell
fastlane
favorited
fff
ffxdq
Firewalled
firewalled
Flexbox
fpm
Fugit
gcloud
gif
githooks
GitLab
globbing
gotestsum
gpg
Gradle
Graviton
gz
gzipped
Hashicorp
heroku
hostname
http
httplog
https
IdP's
inlining
IPs
iTerm
iTerm's
Jenkins
jpegs
jq
json
junit
JWT
JWTs
keyserver
keyservers
kubectl
kustomize
Kuzco
launchd
LFS
libpq
linux
macOS
Memcache
minitest
misconfiguration
mitigation
mitigations
monorepo
mutex
namespace
namespaced
namespaces
navatar
negator
NGINX
Nodejs
Noreply
npm
ns
nsc
nssm
NVMe
OAuth
oidc
Okta
onboarding
Pagerduty
parsable
pbuilder
pbuilder's
Phabricator
Phabricator's
php
Pipenv
plaintext
plist
png
pngs
Postgres
PowerShell
preemptible
prefill
proxied
pty
pullrequest
pybuildkite
pytest
rbenv
readme
readmes
refetch
refspec
repo
routable
rpmbuild
RSpec
ruleset
runtimes
rvm
sandboxed
sed
scriptwrapper
sha
sharding
Shardy
shasum
shellcheck
shellscripting
Shipit
snake_case
Splitter's
sre
sso
statefully
stdout
subcommand
subcommands
subfolders
submenu
subnet
subnets
subnet's
substrings
sudo
svg
swiftformat
systemd
templated
tgz
timeframe
tmp
tmux
toolmantim
tooltip
TOTP's
udp
unmanaged
unarchive
unarchived
unarchiving
unblocker
unbuildable
unclustered
unencrypted
unset
unsets
unsetting
untrusted
unxip
uploaders
url
urls
util
uuid
UUIDs
vendored
virtualenv
VMs
VPC's
VPCs
waitlist
walkthrough
webhook's
webtask
wget
worktree
workspace's
xcbeautify
Xcode
xcode
xcodebuild
xcpretty
XCTest
xUnit
yaml
yml
yq
yyy
Zapier
zstd
zzglob
zzz

# GraphQL code words
# TODO: format these as code instead of making exceptions
heartbeatAt
TOTPActivate
TOTPActivate
TOTPCreate
TOTPCreate
TOTPDelete
