ACLs
addr
allow_any_instance_of
Allowlist
allowlist
AMI's
AMIs
API
API's
APIs
apk
applesimutils
architecting
argumentless
Artifactory
Artifactory's
Atlassian
Authy
auditable
autogenerate
autogenerated
autogenerates
autoscale
autoscaler
Autoscaling
autoscaling
aws
awscli
azcopy
Basecamp
Basscss
Bazel
bazelisk
Bitium
bktec
boolean
Boomper
Buildbox
Buildkite
Buildkite's
buildscript
Bundler
cancelation
carthage
CCMenu
ccnet
CCTray
chatbot
chroot
chroots
CI
classpath
cli
Cloudsmith
Cloudsmith's
CloudTrail
CloudWatch
CMake
cmake
cocoapods
commit_sha
completion_watcher
composable
config
configmap
cpu
cron
crontab
Crontab
Datadog
debuild
deduper
deno
deprioritize
deprovisioning
deregistration
deprovision
dialog's
distro
distutils
Dockerfile
Docker's
Dockerfile
dogstatsd
dotenv
DSCs
enqueued
enum
env
eval
Eventbridge
EventBridge
Explainshell
fastlane
fastlane's
favorited
fff
ffxdq
Firewalled
firewalled
Flexbox
fpm
Fugit
gcloud
gh
gif
githooks
GitLab
globbing
gmp
gnupg
gotestsum
gpg
Gradle
gradle
Gradle's
Graviton
gz
gzipped
Hashicorp
heroku
hostname
http
httpd
httplog
https
IdP's
inlining
IPs
iTerm
iTerm's
Jenkins
JFrog
JFrog's
job_watcher
jobWatcher
jpegs
jq
json
junit
JWT
JWTs
keyserver
keyservers
kotlin
kubectl
kustomize
Kuzco
launchd
LFS
libpq
linux
llamasecret
macOS
macos
matchers
Memcache
minitest
misconfiguration
mitigation
mitigations
monorepo
mutex
namespace
namespaced
namespaces
navatar
negator
NGINX
nginx
Nodejs
nodeName
nodeSelector
Noreply
npm
ns
nsc
nssm
nullable
NVMe
OAuth
oidc
Okta
onboarding
Pagerduty
parsable
pbuilder
pbuilder's
perl
Phabricator
Phabricator's
php
Pipenv
pkgconf
plaintext
plist
png
pngs
pod_watcher
podWatcher
Postgres
PowerShell
PR's
preemptible
prefill
proxied
pty
pullrequest
pybuildkite
pytest
rbenv
readme
readmes
refetch
refspec
reimagined
repo
resizable
routable
rpmbuild
RSpec
ruleset
runtimes
rustup
rvm
sandboxed
sed
scriptwrapper
SDK's
sha
sharding
Shardy
shasum
shellcheck
shellscripting
Shipit
snake_case
Sonoma
Splitter's
sre
sso
statefully
stdout
stringified
subcommand
subcommands
subfolders
submenu
subnet
subnets
subnet's
substrings
sudo
svg
swiftformat
systemd
templated
tgz
timeframe
tmp
tmux
toolmantim
tooltip
TOTP's
udp
unmanaged
unarchive
unarchived
unarchiving
unblocker
unbuildable
unclustered
unencrypted
unset
unsets
unsetting
untrusted
unxip
uploaders
upstreams
url
urls
util
uuid
UUIDs
uv
vendored
virtualenv
Vitest
VMs
VPC's
VPCs
waitlist
walkthrough
webhook's
webtask
wget
worktree
workspace's
xcbeautify
Xcode
xcode
xcodebuild
xcodes
xcpretty
XCTest
xUnit
yaml
yml
yq
yyy
Zapier
zstd
zzglob
zzz

# GraphQL code words
# TODO: format these as code instead of making exceptions
heartbeatAt
TOTPActivate
TOTPActivate
TOTPCreate
TOTPCreate
TOTPDelete

Enums

Input_objects

agentPause
agentResume
agentStop

buildAnnotate
buildCancel
buildCreate
buildRebuild

clusterCreate
clusterDelete
clusterUpdate

emailCreate

noticeDismiss

pipelineArchive
pipelineCreate
pipelineDelete
pipelineFavorite
pipelineUnarchive
pipelineUpdate

ruleCreate
ruleDelete
ruleUpdate

teamCreate
teamDelete
teamUpdate

totpActivate
totpCreate
totpDelete

__Directive
__Field
__Schema
__Type

APIApplication

SCMService

SSOAuthorization

agentToken

auditEvent

graphQLSnippet

notificationService

organizationInvitation
organizationMember

pipelineSchedule
pipelineTemplate

SSOProvider

ssoProvider

JSInt

landing_page

bazel

github

landing_page_pipelines
