ACLs
addr
allow_any_instance_of
Allowlist
allowlist
AMI's
AMIs
Ansible
API
API's
APIs
apk
APM
applesimutils
Amazon ECR
Amazon Elastic Continer Registry
Anthropic's
Aqua
architecting
Argo
argumentless
Artifactory
Artifactory's
Atlassian
Authy
auditable
autogenerate
autogenerated
autogenerates
automations
autoscale
autoscaler
Autoscaling
autoscaling
aws
awscli
azcopy
Backstage
Backstage Software Catalog
Basecamp
Basscss
Bayesian
Bazel
bazelisk
Bitium
Bitbucket
bktec
bktec's
boolean
Boomper
Buildbox
buildevents
Buildah
BuildKit
Buildkite
Buildkite's
buildscript
Bundler
cancelation
carthage
CCMenu
ccnet
CCTray
Chainguard
chatbot
chroot
chroots
CI
classpath
cli
CLI
Cloudsmith
Cloudsmith's
CloudTrail
CloudWatch
CMake
cmake
cocoapods
codeql
codesign
codesigning
commit_sha
completion_watcher
composable
config
configmap
Containerfile
Containerfiles
cpu
cron
crontab
Crontab
CVE
CVEs
daemonless
Datadog
Datadog's
daemonless
debuild
declaratively
deduper
deno
deprioritize
deprovisioning
deregistration
deprovision
dialog's
discoverability
distro
distutils
Dockerfile
Dockerfiles
Docker's
Dockerfile
Docker-in-Docker
dogstatsd
dotenv
DSCs
enqueued
Entra
enum
env
errored
eval
Eventbridge
EventBridge
exfiltrated
exfiltration
Explainshell
fastfile
fastlane
fastlane's
favorited
fff
ffxdq
Firewalled
firewalled
Flexbox
fpm
Fugit
gcloud
gh
gif
githooks
GitLab
globbing
gmp
gnupg
gotestsum
gpg
Gradle
gradle
Gradle's
graphql_id
Graviton
GRC
gz
gzipped
Hashicorp
Homebrew
heroku
Honeycomb
hostname
http
httpd
httplog
https
IdP's
inlining
IPs
iTerm
iTerm's
Jenkins
Jenkinsfile
JFrog
JFrog's
job_watcher
jobWatcher
jpegs
jq
json
junit
JWT
JWTs
Kaniko
keyserver
keyservers
keyless
kotlin
kubectl
kustomize
Kuzco
launchd
LFS
libpq
linux
llamasecret
LLMs
llvm
macOS
macos
matchfile
matchers
Memcache
minitest
misconfiguration
mitigation
mitigations
monorepo
mrkdwn
multi-file
mutex
namespace
namespaced
namespaces
navatar
negator
NGINX
nginx
Nodejs
nodeName
nodeSelector
Noreply
npm
ns
nsc
nssm
nullable
NVMe
OAuth
oidc
Okta
OpenTelemetry
opentelemetry
onboarding
OTLP
otlp
overprivileged
Pagerduty
ptrace
parsable
parallelization
pbuilder
pbuilder's
perl
Phabricator
Phabricator's
php
Pipenv
pkgconf
plaintext
plist
png
pngs
pod_watcher
podWatcher
Postgres
PowerShell
PR's
Prometheus
protobuf
preemptible
prefill
proxied
pty
pullrequest
pybuildkite
pytest
rbenv
readme
readmes
rearchitect
refetch
refspec
rehydrate
rehydrated
reimagined
remediation
remediations
repo
reprioritize
reprioritizes
resizable
retrigger
routable
rpmbuild
RSpec
ruleset
runtimes
rustup
rvm
sandboxed
seccomp
sed
scriptwrapper
SDK's
sha
sharding
Shardy
shasum
shellcheck
shellscripting
Shipit
signaltometrics
SLO
SLOs
snake_case
Sonar
SonarCloud
SonarQube
SonarScanner
Snyk
Sonatype
Sonoma
Splitter's
sre
sso
statefully
stdout
streamable
stringified
subcommand
subcommands
subfolders
submenu
subnet
subnets
subnet's
substrings
sudo
svg
swiftformat
swiftlint
systemd
templated
tgz
timeframe
tmp
tmux
tokenization
toolmantim
toolset
toolsets
tooltip
TOTP's
Trivy
typosquatted
udp
unmanaged
UserData
unarchive
unarchived
unarchiving
unblocker
unbuildable
unclustered
unencrypted
unpatched
unpermitted
unreviewed
unset
unsets
unsetting
untrusted
unxip
uploaders
upstreams
url
urls
userdata
util
uuid
UUIDs
uv
vendored
vfs
virtualenv
virtualized
Vitest
VMs
VPC's
VPCs
waitlist
walkthrough
webhook's
webtask
wget
Windsurf's
worktree
workspace's
xcbeautify
Xcode
xcode
xcodebuild
xcodes
xcpretty
XCTest
xUnit
yaml
yml
yq
yyy
Zapier
zstd
zzglob
zzz

# GraphQL code words
# TODO: format these as code instead of making exceptions
heartbeatAt
TOTPActivate
TOTPActivate
TOTPCreate
TOTPCreate
TOTPDelete

Enums

Input_objects

agentPause
agentResume
agentStop

buildAnnotate
buildCancel
buildCreate
buildRebuild

clusterCreate
clusterDelete
clusterUpdate

emailCreate

noticeDismiss

pipelineArchive
pipelineCreate
pipelineDelete
pipelineFavorite
pipelineUnarchive
pipelineUpdate

ruleCreate
ruleDelete
ruleUpdate

teamCreate
teamDelete
teamUpdate

totpActivate
totpCreate
totpDelete

__Directive
__Field
__Schema
__Type

APIApplication

SCMService

SSOAuthorization

agentToken

auditEvent

graphQLSnippet

notificationService

organizationInvitation
organizationMember

pipelineSchedule
pipelineTemplate

SSOProvider

ssoProvider

JSInt

landing_page

bazel

github

landing_page_pipelines

eg

base_sha
base_ref
head_sha
head_ref
if_changed
