Allowlist
allowlist
Artifactory
Artifactory's
Atlassian
Authy
Autoscaling
Basecamp
Basscss
Bazel
Bitium
Boomper
Buildbox
Buildkite
Buildkite's
CI
CloudWatch
Crontab
Datadog
Deprovisioning
Distro
Docker's
Dockerfile
Enum
Eventbridge
Explainshell
Firewalled
Flexbox
Fugit
GitLab
Gradle
Hashicorp
Inlining
Jenkins
JWT
JWTs
Kuzco
Memcache
minitest
misconfiguration
Namespace
Namespaced
Namespaces
Noreply
Okta
Pagerduty
Phabricator
Phabricator's
Pipenv
Postgres
Powershell
Readme
RSpec
Shardy
Shellcheck
Shipit
Unencrypted
Unset
Unsets
Unsetting
Webtask
Xcode
Zapier
addr
api
apis
architecting
argumentless
artifactory
auditable
autogenerate
autogenerated
autogenerates
autoscale
autoscaler
autoscaling
aws
boolean
boomper
buildscript
cancelation
ccnet
chatbot
chroot
chroots
ci
classpath
cli
composable
config
cpu
cron
crontab
Datadog
deprioritize
deprovisioning
deregistration
deprovision
distro
Dockerfile
dogstatsd
enum
env
eval
eventbridge
favorited
fff
ffxdq
gcloud
gif
githooks
globbing
golang
gotestsum
Graviton
gz
gzipped
heroku
hostname
http
https
inlining
jpegs
json
junit
kubectl
kustomize
launchd
LFS
linux
Memcache
Minitest
mitigation
mitigations
monorepo
mutex
namespace
namespaced
namespaces
negator
npm
nssm
onboarding
parsable
phabricator
php
plaintext
plist
png
pngs
powershell
preemptible
prefill
pty
pullrequest
pybuildkite
pytest
readme
readmes
refetch
refspec
repo
routable
ruleset
rvm
sandboxed
sed
scriptwrapper
sha
sharding
shasum
Shellcheck
shellscripting
Shipit
sre
sso
statefully
stdout
subcommand
subcommands
subfolders
submenu
subnet
subnets
subnet's
substrings
sudo
svg
systemd
templated
timeframe
tmp
toolmantim
tooltip
udp
unarchive
unarchived
unblocker
unbuildable
unclustered
unencrypted
unmanaged
untrusted
unset
unsets
unsetting
url
urls
util
uuid
vendored
waitlist
walkthrough
webhook's
webtask
worktree
workspace's
xcode
xcodebuild
xcpretty
yaml
yml
yyy
zzz
ACLs
AMI's
AMIs
API's
CCMenu
CCTray
IdP's
iTerm
iTerm's
NVMe
OAuth
TOTP's
UUIDs
VMs
VPC's
VPCs
XCTest
xUnit
dotenv

# GraphQL code words
# TODO: format these as code instead of making exceptions
heartbeatAt
TOTPActivate
TOTPActivate
TOTPCreate
TOTPCreate
TOTPDelete
